ves=95
plves=2
proc = 0.165
lunnves = ves * proc
print()
print("=============================================================================")
print('На Луне, твой вес бы составил - %s килограмм' % lunnves)
print("=============================================================================")
i = 0
print()
#nachgod=int(input('С какого года ты планируешь жить на Луне?\n'))
let=10


for week in range(1, let):
	summ = ves*proc
	ves += plves

	print("=============================================================================")
	print('В', week, 'году, твой вес составит ==', round(summ, 1), 'килограмм')
